Revit 2027 API
ParameterTypeId.JoistSystemNumBeamsSameType Property
 "Num. of Beams With Same Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId JoistSystemNumBeamsSameType { get; }
Public Shared ReadOnly Property JoistSystemNumBeamsSameType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ JoistSystemNumBeamsSameType {
	ForgeTypeId^ get ();
}
static member JoistSystemNumBeamsSameType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace